Repository: 84000/data-translation-memory
Catalog: toh1095-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱལ་པོ། འཕགས་པ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble King of Prayers of Good Conduct Homage to Noble Mañjuśrīkumārabhūta.

source: ཇི་སྙེད་སུ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། །དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་ཀུན། །བདག་གིས་མ་ལུས་དེ་དག་ཐམས་ཅད་ལ། །ལུས་དང་ངག་ཡིད་དང་བས་ཕྱག་བགྱིའོ། །
en: However many lions among men there are In the three times, in the worlds in the ten directions, I pay homage to them all without exception, With purity of body, speech, and mind.

source: བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་སྟོབས་དག་གིས། །རྒྱལ་བ་ཐམས་ཅད་ཡིད་ཀྱིས་མངོན་སུམ་དུ། །ཞིང་གི་རྡུལ་སྙེད་ལུས་རབ་བཏུད་པ་ཡིས། །རྒྱལ་བ་ཀུན་ལ་རབ་ཏུ་ཕྱག་འཚལ་ལོ། །
en: {1} Thinking that all the jinas are before me, With the power of the prayer of good conduct, I bow down toward all the jinas With as many bodies as there are atoms in the realms.

source: རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་སངས་རྒྱས་རྣམས། །སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་དག །
en: {2} There are as many buddhas as atoms within a single atom, Seated in the midst of bodhisattvas.

source: དེ་ལྟར་ཆོས་ཀྱི་དབྱིངས་རྣམས་མ་ལུས་པ། །ཐམས་ཅད་རྒྱལ་བ་དག་གིས་གང་བར་མོས། །
en: I focus on the entire realm of phenomena, Without exception, being filled by jinas in that way.

source: དེ་དག་བསྔགས་པ་མི་ཟད་རྒྱ་མཚོ་རྣམས། །དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་ཀུན་གྱིས། །རྒྱལ་བ་ཀུན་གྱི་ཡོན་ཏན་རབ་བརྗོད་ཅིང་། །བདེ་བར་གཤེགས་པ་ཐམས་ཅད་བདག་གིས་བསྟོད། །
en: {3} I recite a praise of all the sugatas, Enumerating the qualities of all the jinas, With unending oceans of eulogies And the sound of oceans of every quality of voice.

source: མེ་ཏོག་དམ་པ་ཕྲེང་བ་དམ་པ་དང་། །སིལ་སྙན་རྣམས་དང་བྱུག་པ་གདུགས་མཆོག་དང་། །མར་མེ་མཆོག་དང་བདུག་པ་དམ་པ་ཡིས། །རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱི། །
en: {4} I make an offering to those jinas Of perfect flowers, perfect garlands, Perfect music, ointments, and parasols, Perfect lights, and perfect incenses.

source: ན་བཟའ་དམ་པ་རྣམས་དང་དྲི་མཆོག་དང་། །ཕྱེ་མའི་ཕུར་མ་རི་རབ་མཉམ་པ་དང་། །བཀོད་པའི་ཁྱད་པར་འཕགས་པ་མཆོག་ཀུན་གྱིས། །རྒྱལ་བ་དེ་དག་ལ་ནི་མཆོད་པར་བགྱིད། །
en: {5} I make offerings to those jinas Of perfect clothing and perfect perfumes, Pouches of scented powders equal to Mount Meru, And all perfect, sublime displays.

source: མཆོད་པ་གང་རྣམས་བླ་མེད་རྒྱ་ཆེ་བ། །དེ་དག་རྒྱལ་བ་ཐམས་ཅད་ལ་ཡང་མོས། །བཟང་པོ་སྤྱོད་ལ་དད་པའི་སྟོབས་དག་གིས། །
en: {6} Offerings that are unsurpassable and exalted I am resolved to offer to all the jinas.

source: རྒྱལ་བ་ཀུན་ལ་ཕྱག་འཚལ་མཆོད་པར་བགྱི། །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་དབང་གིས་ན། །ལུས་དང་ངག་དང་དེ་བཞིན་ཡིད་ཀྱིས་ཀྱང་། །སྡིག་པ་བདག་གིས་བགྱིས་པ་ཅི་མཆིས་པ། །དེ་དག་ཐམས་ཅད་བདག་གིས་སོ་སོར་བཤགས། །
en: I praise and make offerings to all the jinas Through the power of devotion to good conduct.{7} Whatever bad actions I have done Under the power of desire, anger, and ignorance, With my body, speech, and mind, I make a confession of them all.

source: ཕྱོགས་བཅུའི་རྒྱལ་བ་ཀུན་དང་སངས་རྒྱས་སྲས། །རང་རྒྱལ་རྣམས་དང་སློབ་དང་མི་སློབ་དང་། །འགྲོ་བ་ཀུན་གྱི་བསོད་ནམས་གང་ལ་ཡང་། །དེ་དག་ཀུན་གྱི་རྗེས་སུ་བདག་ཡི་རང་། །
en: {8} I am rejoicing in the entirety of merit In the ten directions that is created by beings, By practicing and accomplished pratyeka­buddhas, By the bodhisattvas, and by all the jinas.

source: གང་རྣམས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་སྒྲོན་མ་དག །བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་མ་ཆགས་བརྙེས། །མགོན་པོ་དེ་དག་བདག་གིས་ཐམས་ཅད་ལ། །འཁོར་ལོ་བླ་ན་མེད་པ་བསྐོར་བར་བསྐུལ། །
en: {9} I make the request to all the lords, The lamps of the worlds in the ten directions, Who have attained without impediment the enlightenment of buddhahood, That they turn the unsurpassable wheel.

source: མྱ་ངན་འདས་སྟོན་གང་བཞེད་དེ་དག་ལ། །འགྲོ་བ་ཀུན་ལ་ཕན་ཞིང་བདེ་བའི་ཕྱིར། །བསྐལ་བ་ཞིང་གི་རྡུལ་སྙེད་བཞུགས་པར་ཡང་། །བདག་གིས་ཐལ་མོ་རབ་སྦྱར་གསོལ་བར་བགྱི། །
en: {10} With palms placed together, I supplicate Those who wish to manifest passing into nirvāṇa That they remain for as many kalpas as there are atoms in the realms, For the benefit and happiness of all beings.

source: ཕྱག་འཚལ་བ་དང་མཆོད་ཅིང་བཤགས་པ་དང་། །རྗེས་སུ་ཡི་རང་བསྐུལ་ཞིང་གསོལ་བ་ཡིས། །དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསགས་པ། །ཐམས་ཅད་བདག་གིས་བྱང་ཆུབ་ཕྱིར་བསྔོའོ། །
en: {11} Whatever little virtue I have accumulated Through homage, offering, confession, Rejoicing, supplication, and entreating, I dedicate it all to enlightenment.

source: འདས་པའི་སངས་རྒྱས་རྣམས་དང་ཕྱོགས་བཅུ་ཡི། །འཇིག་རྟེན་དག་ན་གང་བཞུགས་མཆོད་པར་གྱུར། །
en: {12} May the buddhas of the past and those who are present In the worlds of the ten directions be offered to.

source: གང་ཡང་མ་བྱོན་དེ་དག་རབ་མྱུར་བར། །བསམ་རྫོགས་བྱང་ཆུབ་རིམ་པར་སངས་རྒྱས་སྤྱོན། །
en: May those in the future swiftly fulfill Their aspirations for the enlightenment of buddhahood.

source: ཕྱོགས་བཅུ་ག་ལའི་ཞིང་རྣམས་ཇི་སྙེད་པ། །དེ་དག་རྒྱ་ཆེར་ཡོངས་སུ་དག་པར་གྱུར། །
en: {13} May the realms that are in the ten directions Become purified and sublime.

source: བྱང་ཆུབ་ཤིང་དབང་དྲུང་གཤེགས་རྒྱལ་བ་དང་། །
en: May they become filled with jinas, who have come To the Bodhi tree, the lord of trees, and with bodhisattvas.

source: སངས་རྒྱས་སྲས་ཀྱིས་རབ་ཏུ་གང་བར་ཤོག །ཕྱོགས་བཅུའི་སེམས་ཅན་གང་རྣམས་ཇི་སྙེད་པ། །དེ་དག་རྟག་ཏུ་ནད་མེད་བདེ་བར་འགྱུར། །
en: {14} However many beings there are in the ten directions, May they all be always happy and healthy.

source: འགྲོ་བ་ཀུན་གྱི་ཆོས་ཀྱིས་དོན་རྣམས་ནི། །མཐུན་པར་གྱུར་ཅིང་རེ་བའང་འགྲུབ་པར་ཤོག །
en: May all beings be successful in their Dharma goals, And may their wishes be fulfilled.

source: བྱང་ཆུབ་སྤྱོད་པ་དག་ནི་བདག་སྤྱོད་ཅིང་། །འགྲོ་བ་ཀུན་ཏུ་སྐྱེ་བ་དྲན་པར་འགྱུར། །
en: {15} May I practice the conduct of enlightenment And remember my lives in all existences.

source: ཚེ་རབས་ཀུན་ཏུ་འཆི་འཕོ་སྐྱེ་བ་ན། །རྟག་ཏུ་བདག་ནི་རབ་ཏུ་འབྱུང་བར་ཤོག །
en: May I always practice mendicancy In all my lifetimes of deaths and rebirths.

source: རྒྱལ་བ་ཀུན་གྱི་རྗེས་སུ་སློབ་གྱུར་ཏེ། །བཟང་པོ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་། །ཚུལ་ཁྲིམས་སྤྱོད་པ་དྲི་མེད་ཡོངས་དག་པར། །རྟག་ཏུ་མ་ཉམས་སྐྱོན་མེད་སྤྱོད་པར་ཤོག །
en: {16} Following the teaching of all the jinas And perfecting my good conduct, May I always practice stainless, pure, Correct conduct that is flawless and unblemished.

source: ལྷ་ཡི་སྐད་དང་ཀླུ་དང་གནོད་སྦྱིན་སྐད། །གྲུལ་བུམ་དག་དང་མི་ཡི་སྐད་རྣམས་དང་། །འགྲོ་བ་ཀུན་གྱི་སྒྲ་རྣམས་ཇི་ཙམ་པར། །ཐམས་ཅད་སྐད་དུ་བདག་གིས་ཆོས་བསྟན་ཏོ། །
en: {17} May I teach the Dharma in all languages, Whatever the languages of beings: Through the languages of devas, the languages of nāgas, The languages of yakṣas, kumbhāṇḍas, and humans.

source: དེས་ཤིང་ཕ་རོལ་ཕྱིན་ལ་རབ་བརྩོན་ཏེ། །བྱང་ཆུབ་སེམས་ནི་ནམ་ཡང་བརྗེད་མ་གྱུར། །
en: {18} May one who is gentle and dedicated to the perfections Never forget the aspiration to enlightenment.

source: སྡིག་པ་གང་རྣམས་སྒྲིབ་པར་གྱུར་པ་དག །དེ་དག་མ་ལུས་ཡོངས་སུ་བྱང་བར་ཤོག །
en: May the obscurations of bad karma Be purified without any remainder.

source: ལས་དང་ཉོན་མོངས་བདུད་ཀྱི་ལས་རྣམས་ལས། །གྲོལ་ཞིང་འཇིག་རྟེན་འགྲོ་བ་རྣམས་སུ་ཡང་། །ཇི་ལྟར་པདྨ་ཆུས་མི་ཆགས་པ་བཞིན། །ཉི་ཟླ་ནམ་མཁའ་ཐོགས་པ་མེད་ལྟར་སྤྱད། །ཞིང་གི་ཁྱོན་དང་ཕྱོགས་རྣམས་ཇི་ཙམ་པར། །
en: {19} May my conduct, even in the worldly existences, Be free of karma, kleśas, and the actions of Māra, Just as the lotus is unstained by water And the sun and moon are unobstructed in the sky.

source: ངན་སོང་སྡུག་བསྔལ་རབ་ཏུ་ཞི་བར་བྱེད། །བདེ་བ་དག་ལ་འགྲོ་བ་ཀུན་འགོད་ཅིང་། །འགྲོ་བ་ཐམས་ཅད་ལ་ནི་ཕན་པར་སྤྱད། །
en: {20} May I end all the sufferings of lower existences And establish all beings in happiness, Practicing a conduct that brings benefit to all beings Throughout the directions and the extent of realms.

source: བྱང་ཆུབ་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་བྱེད་ཅིང་། །སེམས་ཅན་རྣམས་ཀྱི་སྤྱོད་དང་མཐུན་པར་འཇུག །བཟང་པོ་སྤྱོད་པ་དག་ནི་རབ་སྟོན་ཅིང་། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱོད་པར་གྱུར། །
en: {21} May I practice this conduct in all future kalpas, Conforming with the conduct of beings, Perfecting the conduct of enlightenment, And teaching good conduct.

source: བདག་གིས་སྤྱོད་དང་མཐུན་པར་གང་སྤྱོད་པ། །དེ་དག་དང་ནི་རྟག་ཏུ་འགྲོགས་པར་ཤོག །
en: {22} May I always be in the company of those Whose conduct is in harmony with my conduct.

source: ལུས་དང་ངག་རྣམས་དང་ནི་སེམས་ཀྱིས་ཀྱང་། །སྤྱོད་པ་དག་དང་སྨོན་ལམ་གཅིག་ཏུ་སྤྱད། །
en: May my body, my speech, and also my mind Practice the same conduct and have the same prayer.

source: བདག་ལ་ཕན་པར་འདོད་པའི་གྲོགས་པོ་དག །བཟང་པོ་སྤྱོད་པ་རབ་ཏུ་སྟོན་པ་རྣམས། །དེ་དག་དང་ཡང་རྟག་ཏུ་ཕྲད་པར་ཤོག །དེ་དག་བདག་གིས་ནམ་ཡང་ཡིད་མི་དབྱུང་། །
en: {23} May I always associate With friends who wish to benefit me And teach me the correct conduct, And may I never displease them.

source: སངས་རྒྱས་སྲས་ཀྱིས་བསྐོར་བའི་མགོན་པོ་རྣམས། །མངོན་སུམ་རྟག་ཏུ་བདག་གིས་རྒྱལ་བ་བལྟ། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་མི་སྐྱོ་བར། །དེ་དག་ལ་ཡང་མཆོད་པ་རྒྱ་ཆེར་བགྱི། །
en: {24} May I always see before me the jinas, The lords who are encircled by bodhisattvas, And may I make vast offerings to them, Without wearying, throughout all future kalpas.

source: རྒྱལ་བ་རྣམས་ཀྱི་དམ་པའི་ཆོས་འཛིན་ཅིང་། །བྱང་ཆུབ་སྤྱོད་པ་ཀུན་ཏུ་སྣང་བར་བྱེད། །བཟང་པོ་སྤྱོད་པ་རྣམ་པར་སྤྱད་པ་ཡང་། །མ་འོངས་བསྐལ་པ་ཀུན་ཏུ་སྤྱད་པར་བགྱི། །
en: {28} Keeping the good Dharma of the jinas, Expounding the conduct of enlightenment, And purifying the good conduct, May I practice that conduct in all future kalpas.

source: སྲིད་པ་ཐམས་ཅད་དུ་ནི་འཁོར་བ་ན། །བསོད་ནམས་ཡེ་ཤེས་དག་ནི་མི་ཟད་རྙེད། །
en: {26} While circling through all existences, May I obtain inexhaustible merit and knowledge.

source: ཐབས་དང་ཤེས་རབ་ཏིང་འཛིན་རྣམ་ཐར་དང་། །ཡོན་ཏན་ཀུན་གྱི་མི་ཟད་མཛོད་དུ་གྱུར། །
en: May I be an inexhaustible treasure of wisdom, Methods, samādhis, liberations, and all good qualities.

source: རྡུལ་གཅིག་སྟེང་ན་རྡུལ་སྙེད་ཞིང་རྣམས་ཏེ། །ཞིང་དེར་བསམ་གྱིས་མི་ཁྱབ་སངས་རྒྱས་རྣམས། །སངས་རྒྱས་སྲས་ཀྱི་དབུས་ན་བཞུགས་པ་ལ། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་ཅིང་བལྟ་བར་བགྱི། །
en: {27} There are realms as numerous as atoms in each atom, And while practicing the conduct of enlightenment, May I see in those realms countless buddhas Who are seated in the midst of bodhisattvas.

source: དེ་ལྟར་མ་ལུས་ཐམས་ཅད་ཕྱོགས་སུ་ཡང་། །སྐྲ་ཙམ་ཁྱོན་ལ་དུས་གསུམ་ཚད་སྙེད་ཀྱིས། །སངས་རྒྱས་རྒྱ་མཚོ་ཞིང་རྣམས་རྒྱ་མཚོ་དང་། །བསྐལ་པ་རྒྱ་མཚོར་སྤྱོད་ཅིང་རབ་ཏུ་འཇུག །
en: {28} May I engage in practicing conduct for an ocean of kalpas Within every hair’s breadth in every direction, Without exception, in which there are an ocean Of buddhas of the three times, and an ocean of realms.

source: གསུང་གཅིག་ཡན་ལག་རྒྱ་མཚོའི་སྒྲ་སྐད་ཀྱིས། །རྒྱལ་བ་ཀུན་དབྱངས་ཡན་ལག་རྣམ་དག་པ། །འགྲོ་བ་ཀུན་གྱི་བསམ་པ་ཇི་བཞིན་དབྱངས། །སངས་རྒྱས་གསུང་ལ་རྟག་ཏུ་འཇུག་པར་བགྱི། །
en: {29} May I always comprehend the speech of the buddhas, Which, through having an ocean of languages in a single syllable, Has the purity of the aspects of the speech of all the jinas And words that accord with the aspirations of all beings.

source: དུས་གསུམ་གཤེགས་པ་རྒྱལ་བ་ཐམས་ཅད་དག །འཁོར་ལོའི་ཚུལ་རྣམས་རབ་ཏུ་བསྐོར་བ་ཡི། །དེ་དག་གི་ཡང་གསུང་དབྱངས་མི་ཟད་ལ། །བློ་ཡི་སྟོབས་ཀྱིས་བདག་ཀྱང་རབ་ཏུ་འཇུག །
en: {30} May I comprehend, through the power of the mind, The unceasing sounds of the voices Of the jinas in the three times, Who are turning the wheel in various ways.

source: མ་འོངས་བསྐལ་པ་ཐམས་ཅད་འཇུག་པར་ཡང་། །སྐད་ཅིག་གཅིག་གིས་བདག་ཀྱང་འཇུག་པར་བགྱི། །གང་ཡང་བསྐལ་བ་དུས་གསུམ་ཚད་དེ་དག །སྐད་ཅིག་ཆ་ཤས་ཀྱིས་ནི་ཞུགས་པར་སྤྱད། །
en: {31} May I enter all the future kalpas, Entering them in a single instant, And in a fraction of an instant practice The conduct throughout the kalpas of the three times.

source: དུས་གསུམ་གཤེགས་པ་མི་ཡི་སེང་གེ་གང་། །དེ་དག་སྐད་ཅིག་གཅིག་ལ་བདག་གིས་བལྟ། །
en: {32} May I in a single instant see The lions among humans in the three times.

source: རྟག་ཏུ་དེ་དག་གི་ནི་སྤྱོད་ཡུལ་ལ། །སྒྱུ་མར་གྱུར་བའི་རྣམ་ཐར་སྟོབས་ཀྱིས་འཇུག །
en: Through the power of the liberation of being an illusion, May I always enter into their conduct.

source: གང་ཡང་དུས་གསུམ་དག་གི་ཞིང་བཀོད་པ། །དེ་དག་རྡུལ་གཅིག་སྟེང་དུ་མངོན་པར་བསྒྲུབ། །
en: {33} May the displays of realms in the three times Be accomplished within a single atom.

source: དེ་ལྟར་མ་ལུས་ཕྱོགས་རྣམས་ཐམས་ཅད་དུ། །རྒྱལ་བ་དག་གི་ཞིང་རྣམས་བཀོད་ལ་འཇུག །
en: May I perceive such displays of the realms of the jinas That are in every direction without exception.

source: གང་ཡང་མ་བྱོན་འཇིག་རྟེན་སྒྲོན་མ་རྣམས། །དེ་དག་རིམ་པར་འཚང་རྒྱ་འཁོར་ལོ་བསྐོར། །མྱ་ངན་འདས་པ་རབ་ཏུ་ཞི་མཐའ་སྟོན། །མགོན་པོ་ཀུན་གྱི་དྲུང་དུ་བདག་མཆིའོ། །
en: {34} May I go into the presence of all those lords, Those future lamps of the world, who will successively Attain enlightenment, turn the wheel, And demonstrate the final peace of entering nirvāṇa.

source: ཀུན་ཏུ་མྱུར་བའི་རྫུ་འཕྲུལ་སྟོབས་རྣམས་དང་། །ཀུན་ནས་སྒོ་ཡི་ཐེག་པའི་སྟོབས་རྣམས་དང་། །ཀུན་ཏུ་ཡོན་ཏན་སྤྱོད་པའི་སྟོབས་རྣམས་དང་། །ཀུན་ཏུ་ཁྱབ་པ་བྱམས་པ་དག་གི་སྟོབས། །ཀུན་ནས་དགེ་བའི་བསོད་ནམས་སྟོབས་རྣམས་དང་། །ཆགས་པ་མེད་པར་གྱུར་པའི་ཡེ་ཤེས་སྟོབས། །ཤེས་རབ་ཐབས་དང་ཏིང་འཛིན་སྟོབས་དག་གིས། །
en: {35} Through the power of miracles that has complete speed, Through the power of yānas that possesses every gateway, Through the power of conduct that has the complete qualities, Through the power of love that is universal, {36} Through the power of merit that has complete goodness, Through the power of knowledge that is without impediment, Through the power of wisdom, methods, and samādhi, May I accomplish the power of enlightenment.

source: བྱང་ཆུབ་སྟོབས་རྣམས་ཡང་དག་སྒྲུབ་པར་བྱེད། །ལས་ཀྱི་སྟོབས་རྣམས་ཡོངས་སུ་དག་བྱེད་ཅིང་། །ཉོན་མོངས་སྟོབས་རྣམས་ཀུན་ཏུ་འཇོམས་པར་བྱེད། །བདུད་ཀྱི་སྟོབས་རྣམས་སྟོབས་མེད་རབ་བྱེད་ཅིང་། །བཟང་པོ་སྤྱོད་པའི་སྟོབས་ནི་རྫོགས་པར་བགྱི། །
en: {37} May I purify the power of karma, Destroy the power of the kleśas, Render powerless the power of the māras, And make complete all the powers of good conduct.

source: ཞིང་རྣམས་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་། །སེམས་ཅན་རྒྱ་མཚོ་དག་ནི་རྣམ་པར་འགྲོལ། །ཆོས་རྣམས་རྒྱ་མཚོ་རབ་ཏུ་མཐོང་བྱེད་ཅིང་། །ཡེ་ཤེས་རྒྱ་མཚོ་རབ་ཏུ་རྟོགས་པར་བྱེད། །
en: {38} May I purify an ocean of realms, Liberate an ocean of beings, See an ocean of the Dharma, And realize an ocean of knowledge.

source: སྤྱོད་པ་རྒྱ་མཚོ་རྣམ་པར་དག་བྱེད་ཅིང་། །སྨོན་ལམ་རྒྱ་མཚོ་རབ་ཏུ་རྫོགས་པར་བྱེད། །སངས་རྒྱས་རྒྱ་མཚོ་རབ་ཏུ་མཆོད་བྱེད་ཅིང་། །བསྐལ་པ་རྒྱ་མཚོར་མི་སྐྱོ་སྤྱད་པར་བགྱི། །
en: {39} May I purify an ocean of conduct, Fulfill an ocean of prayers, Make offerings to an ocean of buddhas, And have tireless conduct for an ocean of kalpas.

source: གང་ཡང་དུས་གསུམ་གཤེགས་པ་རྒྱལ་བ་ཡི། །བྱང་ཆུབ་སྤྱོད་པའི་སྨོན་ལམ་བྱེ་བྲག་རྣམས། །བཟང་པོ་སྤྱོད་པས་བྱང་ཆུབ་སངས་རྒྱས་ནས། །དེ་ཀུན་མ་ལུས་བདག་གིས་རྫོགས་པར་བགྱི། །
en: {40} May I, through good conduct, realize enlightenment And fulfill, without exception, All the specific prayers of enlightened conduct That are made by the jinas in the three times.

source: རྒྱལ་བ་ཀུན་གྱི་སྲས་ཀྱི་ཐུ་བོ་པ། །གང་གི་མིང་ནི་ཀུན་ཏུ་བཟང་ཞེས་བྱ། །མཁས་པ་དེ་དང་མཚུངས་པར་སྤྱོད་པའི་ཕྱིར། །དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ། །
en: {41} I dedicate all this virtue So that I may have the same conduct as that wise one, The eldest son of all the jinas, Whose name is Samanta­bhadra.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱང་རྣམ་དག་ཅིང་། །སྤྱོད་པ་རྣམ་དག་ཞིང་རྣམས་ཡོངས་དག་དང་། །བསྔོ་བའང་བཟང་བོ་མཁས་པ་ཅི་འདྲ་བར། །དེ་འདྲར་བདག་ཀྱང་དེ་དང་མཚུངས་པར་ཤོག །
en: {42} Just as the good wise one made a dedication For a pure body, speech, and mind, A pure conduct, and a pure realm, May it be the same for me.

source: ཀུན་ནས་དགེ་བ་བཟང་པོ་སྤྱད་པའི་ཕྱིར། །འཇམ་དཔལ་གྱི་ནི་སྨོན་ལམ་སྤྱད་བར་བགྱི། །མ་འོངས་བསྐལ་བ་ཀུན་ཏུ་མི་སྐྱོ་བར། །
en: {43} May I practice the conduct of Mañjuśrī’s prayer Of good conduct, for complete goodness, Without weariness throughout the kalpas to come.

source: དེ་ཡི་བྱ་བ་མ་ལུས་རྫོགས་པར་བགྱི། །སྤྱོད་པ་དག་ནི་ཚད་ཡོད་མ་གྱུར་ཅིག །
en: May I complete all those activities without exception.

source: ཡོན་ཏན་རྣམས་ཀྱང་ཚད་གཟུང་མེད་པར་ཤོག །སྤྱོད་པ་ཚད་མེད་པ་ལ་གནས་ནས་ཀྱང་། །དེ་དག་འཕྲུལ་པ་ཐམས་ཅད་འཚལ་བར་བགྱི། །
en: {44} May there be no limit to that conduct; May there be no limit to those good qualities, And having maintained a conduct that has no limit, May I give rise to all those miraculous powers.

source: ནམ་མཁའི་མཐར་ཐུག་གྱུར་པ་ཇི་ཙམ་པར། །སེམས་ཅན་མ་ལུས་མཐའ་ཡང་དེ་བཞིན་ཏེ། །
en: {45} If there were an end to space, There would be an end to all beings.

source: ཇི་ཙམ་ལས་དང་ཉོན་མོངས་མཐར་གྱུར་པ། །བདག་གི་སྨོན་ལམ་མཐའ་ཡང་དེ་ཙམ་མོ། །
en: Only when their karma and kleśas end Will my prayers also come to an end.

source: གང་ཡང་ཕྱོགས་བཅུའི་ཞིང་རྣམས་མཐའ་ཡས་པ། །རིན་ཆེན་བརྒྱན་ཏེ་རྒྱལ་བ་རྣམས་ལ་ཕུལ། །ལྷ་དང་མི་ཡི་བདེ་བ་མཆོག་རྣམས་ཀྱང་། །ཞིང་གི་རྡུལ་སྙེད་བསྐལ་པར་ཕུལ་བ་བས། །གང་གིས་བསྔོ་བའི་རྒྱལ་པོ་འདི་ཐོས་ནས། །བྱང་ཆུབ་མཆོག་གིས་རྗེས་སུ་རབ་མོས་ཤིང་། །ལན་ཅིག་ཙམ་ཡང་དད་པ་སྐྱེད་པ་ནི། །
en: {46} If someone offered to the jinas the endless realms In the ten directions adorned with jewels And the most excellent pleasures of devas and humans For kalpas as numerous as the atoms in a realm, {47} Someone who has faith just once On hearing this king of dedications And aspires to attain perfect enlightenment Will have a higher, superior merit.

source: བསོད་ནམས་དམ་པའི་མཆོག་ཏུ་འདི་འགྱུར་རོ། །གང་གིས་བཟང་སྤྱོད་སྨོན་ལམ་འདི་བཏབ་པ། །དེས་ནི་ངན་སོང་ཐམས་ཅད་སྤངས་པར་འགྱུར། །དེས་ནི་གྲོགས་པོ་ངན་པ་སྤངས་པ་ཡིན། །སྣང་བ་མཐའ་ཡས་དེ་ཡང་དེས་མྱུར་མཐོང་། །
en: {48} Whoever recites this prayer of good conduct Will be free from all lower existences, Will be free from bad companions, And will quickly see Amitābha.

source: དེ་དག་རྙེད་པ་རབ་རྙེད་བདེ་བར་འཚོ། །མི་ཚེ་འདིར་ཡང་དེ་དག་ལེགས་པར་འོངས། །ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་ཅི་འདྲ་བར། །དེ་དག་རིང་པོར་མི་ཐོགས་དེ་བཞིན་འགྱུར། །
en: {49} They will have in this life the good fortune Of obtaining success, a happy life, And will soon become The same as Samanta­bhadra.

source: མཚམས་མེད་ལྔ་པོ་དག་གི་སྡིག་པ་རྣམས། །གང་གིས་མི་ཤེས་དབང་གིས་བྱས་པ་དག །དེ་ཡིས་བཟང་པོ་སྤྱོད་པ་འདི་བརྗོད་ན། །མྱུར་དུ་མ་ལུས་ཡོངས་སུ་བྱང་བར་འགྱུར། །
en: {50} If someone through the power of ignorance Has the bad karma of the five actions with immediate results, They will be purified of it, without any remainder Through reciting this prayer of good conduct.

source: ཡེ་ཤེས་དང་ནི་གཟུགས་དང་མཚན་རྣམས་དང་། །རིགས་དང་ཁ་དོག་རྣམས་དང་ལྡན་པར་འགྱུར། །བདུད་དང་མུ་སྟེགས་མང་པོས་དེ་མི་ཐུབ། །འཇིག་རྟེན་གསུམ་པོ་ཀུན་ལའང་མཆོད་པར་འགྱུར། །
en: {51} They will have the wisdom, form, Features, family, and color, Be invincible to hosts of māras and tīrthikas, And be offered to by the entire three realms.

source: བྱང་ཆུབ་ཤིང་དབང་དྲུང་དུ་དེ་མྱུར་འགྲོ། །སོང་ནས་སེམས་ཅན་ཕན་ཕྱིར་དེར་འདུག་སྟེ། །བྱང་ཆུབ་སངས་རྒྱས་འཁོར་ལོ་རབ་ཏུ་བསྐོར། །བདུད་རྣམས་སྡེ་དང་བཅས་པ་ཐམས་ཅད་འདུལ། །
en: {52} They will soon go to the Bodhi tree, the lord of trees, And having reached there be seated for the benefit of beings, Become enlightened in buddhahood, turn the wheel of the Dharma, And overpower Māra and his entire army.

source: གང་ཡང་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་འདི། །འཆང་བ་དང་ནི་སྟོན་ཏམ་ཀློག་པ་ཡི། །དེ་ཡི་རྣམ་པར་སྨིན་པ་སངས་རྒྱས་མཁྱེན། །
en: {53} The Buddha knows the result that ripens For the one who possesses, recites, Or teaches this prayer of good conduct.

source: བྱང་ཆུབ་མཆོག་ལ་སོམ་ཉི་མ་བྱེད་ཅིག །
en: Do not doubt the supreme enlightenment!

source: འཇམ་དཔལ་ཇི་ལྟར་མཁྱེན་ཅིང་དཔའ་བ་དང་། །ཀུན་ཏུ་བཟང་པོ་དེ་ཡང་དེ་བཞིན་ཏེ། །
en: {57} Just as the hero Mañjuśrī knows, In that way so does Samanta­bhadra.

source: དེ་དག་གི་ནི་རྗེས་སུ་བདག་སློབ་ཅིང་། །དགེ་བ་འདི་དག་ཐམས་ཅད་རབ་ཏུ་བསྔོ། །
en: In practicing in the same way as they do, I am dedicating all this merit.

source: དུས་གསུམ་གཤེགས་པ་རྒྱལ་བ་ཐམས་ཅད་ཀྱིས། །བསྔོ་བ་གང་ལ་མཆོག་ཏུ་བསྔགས་པ་དེས། །བདག་གི་དགེ་བའི་རྩ་བ་འདི་ཀུན་ཀྱང་། །བཟང་པོ་སྤྱོད་ཕྱིར་རབ་ཏུ་བསྔོ་བར་བགྱི། །
en: {55} With the prayer that is praised as supreme By all the jinas in the three times, I am dedicating all this merit For the supreme good conduct.

source: བདག་ནི་འཆི་བའི་དུས་བྱེད་གྱུར་པ་ན། །སྒྲིབ་པ་ཐམས་ཅད་དག་ནི་ཕྱིར་བསལ་ཏེ། །མངོན་སུམ་སྣང་བ་མཐའ་ཡས་དེ་མཐོང་ནས། །བདེ་བ་ཅན་གྱི་ཞིང་དེར་རབ་ཏུ་འགྲོ། །
en: {56} When the time has come for me to die, May I dispel all obscurations, See Amitābha before me, And go to the Sukhāvatī realm.

source: དེས་སོང་ནས་ནི་སྨོན་ལམ་འདི་དག་ཀྱང་། །ཐམས་ཅད་མ་ལུས་མངོན་སུམ་འགྱུར་བར་ཤོག །དེ་དག་མ་ལུས་བདག་གིས་ཡོངས་སུ་བཀང་། །
en: {57} When I have gone there, may these prayers All become completely manifest.

source: འཇིག་རྟེན་ཇི་སྲིད་སེམས་ཅན་ཕན་པར་བགྱི། །
en: May I fulfill them all without exception And benefit beings for as long as there are worlds.

source: རྒྱལ་བའི་དཀྱིལ་འཁོར་བཟང་ཞིང་དགའ་བ་དེར། །པདྨ་དམ་པ་ཤིན་ཏུ་མཛེས་ལས་སྐྱེས། །སྣང་བ་མཐའ་ཡས་རྒྱལ་ལས་མངོན་སུམ་དུ། །ལུང་བསྟན་པ་ཡང་བདག་གིས་དེར་ཐོབ་ཤོག །
en: {58} May I be born from a beautiful, perfect lotus In that pleasant, beautiful circle of the jinas, And there obtain my prophecy Directly from the Jina Amitābha.

source: དེར་ནི་བདག་གིས་ལུང་བསྟན་རབ་ཐོབ་ནས། །སྤྲུལ་པ་མང་པོ་བྱེ་བ་ཕྲག་བརྒྱ་ཡིས། །བློ་ཡི་སྟོབས་ཀྱིས་ཕྱོགས་བཅུ་རྣམས་སུ་ཡང་། །སེམས་ཅན་རྣམས་ལ་ཕན་པ་མང་པོ་བགྱི། །བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་བཏབ་པ་ཡིས། །
en: {59} Having obtained there the prophecy, May I through the power of mind Bring many benefits to beings in the ten directions Through many billions of emanations.

source: དགེ་བ་ཅུང་ཟད་བདག་གིས་ཅི་བསགས་པ། །དེས་ནི་འགྲོ་བའི་དགེ་བའི་སྨོན་ལམ་རྣམས། །སྐད་ཅིག་གཅིག་གིས་ཐམས་ཅད་འབྱོར་བར་ཤོག །བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་བསྔོས་པ་ཡིས། །
en: {60} May what little merit I have accumulated Through reciting the good conduct prayer Cause the virtuous prayers of beings All to be fulfilled in an instant.

source: བསོད་ནམས་དམ་པ་མཐའ་ཡས་གང་ཐོབ་དེས། །འགྲོ་བ་སྡུག་བསྔལ་ཆུ་བོར་བྱིང་བ་རྣམས། །འོད་དཔག་མེད་པའི་གནས་རབ་ཐོབ་པར་ཤོག །
en: {61} Through the sublime, endless merit attained By my dedicating the good conduct, May the beings drowning in a river of suffering Depart to the supreme residence of Amitābha.

source: སྨོན་ལམ་རྒྱལ་པོ་འདི་མཆོག་གཙོ་དེས་ནི། །འགྲོ་བ་མཐའ་ཡས་ཀུན་ལ་ཕན་བྱེད་ཅིང་། །ཀུན་ཏུ་བཟང་པོས་བརྒྱན་པའི་གཞུང་གྲུབ་ཅིང་། །ངན་སོང་རྒྱུད་གསུམ་མ་ལུས་སྟོངས་པར་ཤོག །
en: {62} The principal excellence of this King of Prayers Brings benefit to all beings without end, And being a text ornamented by Samantabhadra, May the three lower realms, without exception, be emptied. {63}

source: འཕགས་པ་བཟང་པོ་སྤྱོད་པའི་སྨོན་ལམ་གྱི་རྒྱལ་པོ་རྫོགས་སྷོ།། །།
en: This concludes “The Noble King of Prayers of Good Conduct.”
